In [1]:
import pandas as pd

In [2]:
#Series

import pandas as pd
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print("Series \n", series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
## create a  series from dictionary
data = {'a': 1, 'b': 2, 'c': 3}
series_dict = pd.Series(data)
print("Series from dictionary \n", series_dict)

Series from dictionary
 a    1
b    2
c    3
dtype: int64

In [6]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
series_index = pd.Series(data, index=index)
print("Series with custom index \n", series_index)

Series with custom index
 a    10
b    20
c    30
dtype: int64

In [11]:
## DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df= pd.DataFrame(data)
print("DataFrame \n", df)
print(type(df))

DataFrame
       Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
<class 'pandas.core.frame.DataFrame'>

In [9]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [12]:
## Accessing Data in DataFrame
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [15]:
type(df['Name'])

pandas.core.series.Series

In [16]:
df.loc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [19]:
df.iloc[0][1]

C:\Users\pradi\AppData\Local\Temp\ipykernel_21016\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

25

In [20]:
# Accessing a specific column
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [21]:
df.at[1,'Age']

30

In [22]:
df.at[2,'Name']

'Charlie'

In [23]:
## Accessing a specific element using iat
df.iat[2,2]

'Chicago'

In [24]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [25]:
#data Manipulation with DataFrame
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
#Adding a colum
df['Salary']=[50000, 60000, 55000]
df

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   55000

In [27]:
# Remove a colum
df.drop('Salary', axis=1, inplace=True)

In [28]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [30]:
# Add age to the column
df['Age'] = df['Age'] + 5   
df

      Name  Age         City
0    Alice   35     New York
1      Bob   40  Los Angeles
2  Charlie   45      Chicago

In [31]:
df.drop(0, axis=0, inplace=True)

In [32]:
df

      Name  Age         City
1      Bob   40  Los Angeles
2  Charlie   45      Chicago